zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_XCVR_RX_DIG.h
#define XCVR_RX_DIG_DC_RESID_CTRL_DRS_DC_RESID_DLY_MASK (0x70000U)
#define XCVR_RX_DIG_DC_RESID_CTRL_DRS_DC_RESID_DLY_SHIFT (16U)
/*! DC_RESID_DLY - DC Residual Delay */
#define XCVR_RX_DIG_DC_RESID_CTRL_DRS_DC_RESID_DLY(x) (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_DC_RESID_CTRL_DRS_DC_RESID_DLY_SHIFT)) & XCVR_RX_DIG_DC_RESID_CTRL_DRS_DC_RESID_DLY_MASK)

#define XCVR_RX_DIG_DC_RESID_CTRL_DRS_DC_RESID_NWIN2_MASK (0x1FF00000U)
#define XCVR_RX_DIG_DC_RESID_CTRL_DRS_DC_RESID_NWIN2_SHIFT (20U)
/*! DC_RESID_NWIN2 - DC Residual NWIN, for Second Run */
#define XCVR_RX_DIG_DC_RESID_CTRL_DRS_DC_RESID_NWIN2(x) (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_DC_RESID_CTRL_DRS_DC_RESID_NWIN2_SHIFT)) & XCVR_RX_DIG_DC_RESID_CTRL_DRS_DC_RESID_NWIN2_MASK)
/*! @} */

/*! @name DC_RESID_EST - DC Residual Estimate */
/*! @{ */

#define XCVR_RX_DIG_DC_RESID_EST_DC_RESID_OFFSET_I_MASK (0x1FFFU)
#define XCVR_RX_DIG_DC_RESID_EST_DC_RESID_OFFSET_I_SHIFT (0U)
/*! DC_RESID_OFFSET_I - DC Residual Offset I */
#define XCVR_RX_DIG_DC_RESID_EST_DC_RESID_OFFSET_I(x) (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_DC_RESID_EST_DC_RESID_OFFSET_I_SHIFT)) & XCVR_RX_DIG_DC_RESID_EST_DC_RESID_OFFSET_I_MASK)

#define XCVR_RX_DIG_DC_RESID_EST_DC_RESID_OFFSET_Q_MASK (0x1FFF0000U)
#define XCVR_RX_DIG_DC_RESID_EST_DC_RESID_OFFSET_Q_SHIFT (16U)
/*! DC_RESID_OFFSET_Q - DC Residual Offset Q */
#define XCVR_RX_DIG_DC_RESID_EST_DC_RESID_OFFSET_Q(x) (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_DC_RESID_EST_DC_RESID_OFFSET_Q_SHIFT)) & XCVR_RX_DIG_DC_RESID_EST_DC_RESID_OFFSET_Q_MASK)
/*! @} */

/*! @name DFT_TONE_ANALYZER0 - DfT tone analyzer */
/*! @{ */

#define XCVR_RX_DIG_DFT_TONE_ANALYZER0_IPR_DFT_ANA_START_OFFSET_Q_MASK (0x1FFU)
#define XCVR_RX_DIG_DFT_TONE_ANALYZER0_IPR_DFT_ANA_START_OFFSET_Q_SHIFT (0U)
/*! IPR_DFT_ANA_START_OFFSET_Q - Q Initial Phase */
#define XCVR_RX_DIG_DFT_TONE_ANALYZER0_IPR_DFT_ANA_START_OFFSET_Q(x) (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_DFT_TONE_ANALYZER0_IPR_DFT_ANA_START_OFFSET_Q_SHIFT)) & XCVR_RX_DIG_DFT_TONE_ANALYZER0_IPR_DFT_ANA_START_OFFSET_Q_MASK)

#define XCVR_RX_DIG_DFT_TONE_ANALYZER0_IPR_DFT_ANA_START_OFFSET_I_MASK (0x3FE00U)
#define XCVR_RX_DIG_DFT_TONE_ANALYZER0_IPR_DFT_ANA_START_OFFSET_I_SHIFT (9U)
/*! IPR_DFT_ANA_START_OFFSET_I - I Initial Phase */
#define XCVR_RX_DIG_DFT_TONE_ANALYZER0_IPR_DFT_ANA_START_OFFSET_I(x) (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_DFT_TONE_ANALYZER0_IPR_DFT_ANA_START_OFFSET_I_SHIFT)) & XCVR_RX_DIG_DFT_TONE_ANALYZER0_IPR_DFT_ANA_START_OFFSET_I_MASK)

#define XCVR_RX_DIG_DFT_TONE_ANALYZER0_IPR_DFT_ANA_ATTENUATION_Q_MASK (0x1C0000U)
#define XCVR_RX_DIG_DFT_TONE_ANALYZER0_IPR_DFT_ANA_ATTENUATION_Q_SHIFT (18U)
/*! IPR_DFT_ANA_ATTENUATION_Q - Tone Attenuation For Q Path */
#define XCVR_RX_DIG_DFT_TONE_ANALYZER0_IPR_DFT_ANA_ATTENUATION_Q(x) (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_DFT_TONE_ANALYZER0_IPR_DFT_ANA_ATTENUATION_Q_SHIFT)) & XCVR_RX_DIG_DFT_TONE_ANALYZER0_IPR_DFT_ANA_ATTENUATION_Q_MASK)

#define XCVR_RX_DIG_DFT_TONE_ANALYZER0_IPR_DFT_ANA_ATTENUATION_I_MASK (0xE00000U)
#define XCVR_RX_DIG_DFT_TONE_ANALYZER0_IPR_DFT_ANA_ATTENUATION_I_SHIFT (21U)
#define XCVR_RX_DIG_DFT_TONE_ANALYZER0_IPR_DFT_ANA_ATTENUATION_I(x) (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_DFT_TONE_ANALYZER0_IPR_DFT_ANA_ATTENUATION_I_SHIFT)) & XCVR_RX_DIG_DFT_TONE_ANALYZER0_IPR_DFT_ANA_ATTENUATION_I_MASK)

#define XCVR_RX_DIG_DFT_TONE_ANALYZER0_IPR_DFT_ANA_EN_MASK (0x1000000U)
#define XCVR_RX_DIG_DFT_TONE_ANALYZER0_IPR_DFT_ANA_EN_SHIFT (24U)
/*! IPR_DFT_ANA_EN - Enable for DfT tone analyzer */
#define XCVR_RX_DIG_DFT_TONE_ANALYZER0_IPR_DFT_ANA_EN(x) (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_DFT_TONE_ANALYZER0_IPR_DFT_ANA_EN_SHIFT)) & XCVR_RX_DIG_DFT_TONE_ANALYZER0_IPR_DFT_ANA_EN_MASK)
/*! @} */

/*! @name DFT_TONE_ANALYZER1 - DfT tone analyzer */
/*! @{ */

#define XCVR_RX_DIG_DFT_TONE_ANALYZER1_RX_TONE_ANA_ACCU_OVF_MASK (0x1U)
#define XCVR_RX_DIG_DFT_TONE_ANALYZER1_RX_TONE_ANA_ACCU_OVF_SHIFT (0U)
#define XCVR_RX_DIG_DFT_TONE_ANALYZER1_RX_TONE_ANA_ACCU_OVF(x) (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_DFT_TONE_ANALYZER1_RX_TONE_ANA_ACCU_OVF_SHIFT)) & XCVR_RX_DIG_DFT_TONE_ANALYZER1_RX_TONE_ANA_ACCU_OVF_MASK)

#define XCVR_RX_DIG_DFT_TONE_ANALYZER1_RX_TONE_ANA_BITSHIFT_OVF_MASK (0x2U)
#define XCVR_RX_DIG_DFT_TONE_ANALYZER1_RX_TONE_ANA_BITSHIFT_OVF_SHIFT (1U)
#define XCVR_RX_DIG_DFT_TONE_ANALYZER1_RX_TONE_ANA_BITSHIFT_OVF(x) (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_DFT_TONE_ANALYZER1_RX_TONE_ANA_BITSHIFT_OVF_SHIFT)) & XCVR_RX_DIG_DFT_TONE_ANALYZER1_RX_TONE_ANA_BITSHIFT_OVF_MASK)

#define XCVR_RX_DIG_DFT_TONE_ANALYZER1_IPR_DFT_ANA_BITSHIFT_MASK (0x3CU)
#define XCVR_RX_DIG_DFT_TONE_ANALYZER1_IPR_DFT_ANA_BITSHIFT_SHIFT (2U)
#define XCVR_RX_DIG_DFT_TONE_ANALYZER1_IPR_DFT_ANA_BITSHIFT(x) (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_DFT_TONE_ANALYZER1_IPR_DFT_ANA_BITSHIFT_SHIFT)) & XCVR_RX_DIG_DFT_TONE_ANALYZER1_IPR_DFT_ANA_BITSHIFT_MASK)

#define XCVR_RX_DIG_DFT_TONE_ANALYZER1_RX_TONE_ANA_DONE_MASK (0x40U)
#define XCVR_RX_DIG_DFT_TONE_ANALYZER1_RX_TONE_ANA_DONE_SHIFT (6U)
#define XCVR_RX_DIG_DFT_TONE_ANALYZER1_RX_TONE_ANA_DONE(x) (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_DFT_TONE_ANALYZER1_RX_TONE_ANA_DONE_SHIFT)) & XCVR_RX_DIG_DFT_TONE_ANALYZER1_RX_TONE_ANA_DONE_MASK)

#define XCVR_RX_DIG_DFT_TONE_ANALYZER1_IPR_DFT_ANA_START_MASK (0x80U)
#define XCVR_RX_DIG_DFT_TONE_ANALYZER1_IPR_DFT_ANA_START_SHIFT (7U)
#define XCVR_RX_DIG_DFT_TONE_ANALYZER1_IPR_DFT_ANA_START(x) (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_DFT_TONE_ANALYZER1_IPR_DFT_ANA_START_SHIFT)) & XCVR_RX_DIG_DFT_TONE_ANALYZER1_IPR_DFT_ANA_START_MASK)

#define XCVR_RX_DIG_DFT_TONE_ANALYZER1_IPR_DFT_ANA_INPUT_SEL_2_MASK (0x300U)
#define XCVR_RX_DIG_DFT_TONE_ANALYZER1_IPR_DFT_ANA_INPUT_SEL_2_SHIFT (8U)
#define XCVR_RX_DIG_DFT_TONE_ANALYZER1_IPR_DFT_ANA_INPUT_SEL_2(x) (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_DFT_TONE_ANALYZER1_IPR_DFT_ANA_INPUT_SEL_2_SHIFT)) & XCVR_RX_DIG_DFT_TONE_ANALYZER1_IPR_DFT_ANA_INPUT_SEL_2_MASK)

#define XCVR_RX_DIG_DFT_TONE_ANALYZER1_IPR_DFT_ANA_INPUT_SEL_1_MASK (0xC00U)
#define XCVR_RX_DIG_DFT_TONE_ANALYZER1_IPR_DFT_ANA_INPUT_SEL_1_SHIFT (10U)
#define XCVR_RX_DIG_DFT_TONE_ANALYZER1_IPR_DFT_ANA_INPUT_SEL_1(x) (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_DFT_TONE_ANALYZER1_IPR_DFT_ANA_INPUT_SEL_1_SHIFT)) & XCVR_RX_DIG_DFT_TONE_ANALYZER1_IPR_DFT_ANA_INPUT_SEL_1_MASK)

#define XCVR_RX_DIG_DFT_TONE_ANALYZER1_IPR_DFT_ANA_INCREMENT_MASK (0x7F000U)
#define XCVR_RX_DIG_DFT_TONE_ANALYZER1_IPR_DFT_ANA_INCREMENT_SHIFT (12U)
#define XCVR_RX_DIG_DFT_TONE_ANALYZER1_IPR_DFT_ANA_INCREMENT(x) (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_DFT_TONE_ANALYZER1_IPR_DFT_ANA_INCREMENT_SHIFT)) & XCVR_RX_DIG_DFT_TONE_ANALYZER1_IPR_DFT_ANA_INCREMENT_MASK)

#define XCVR_RX_DIG_DFT_TONE_ANALYZER1_IPR_DFT_ANA_CLK_DIV_MASK (0x380000U)
#define XCVR_RX_DIG_DFT_TONE_ANALYZER1_IPR_DFT_ANA_CLK_DIV_SHIFT (19U)
/*! IPR_DFT_ANA_CLK_DIV
 *  0b000..ref_clk
 *  0b001..ref_clk div 2
 *  0b010..ref_clk div 4
 *  0b011..ref_clk div 8
 *  0b100..ref_clk div 16
 */
#define XCVR_RX_DIG_DFT_TONE_ANALYZER1_IPR_DFT_ANA_CLK_DIV(x) (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_DFT_TONE_ANALYZER1_IPR_DFT_ANA_CLK_DIV_SHIFT)) & XCVR_RX_DIG_DFT_TONE_ANALYZER1_IPR_DFT_ANA_CLK_DIV_MASK)
/*! @} */

/*! @name DFT_TONE_ANALYZER2 - DfT tone analyzer */
/*! @{ */

