zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_XCVR_RX_DIG.h
#define XCVR_RX_DIG_DFT_TONE_ANALYZER2_RX_TONE_ANA_OUT_Q_MASK (0xFFFFU)
#define XCVR_RX_DIG_DFT_TONE_ANALYZER2_RX_TONE_ANA_OUT_Q_SHIFT (0U)
/*! RX_TONE_ANA_OUT_Q - Accumulator Q path result. */
#define XCVR_RX_DIG_DFT_TONE_ANALYZER2_RX_TONE_ANA_OUT_Q(x) (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_DFT_TONE_ANALYZER2_RX_TONE_ANA_OUT_Q_SHIFT)) & XCVR_RX_DIG_DFT_TONE_ANALYZER2_RX_TONE_ANA_OUT_Q_MASK)

#define XCVR_RX_DIG_DFT_TONE_ANALYZER2_RX_TONE_ANA_OUT_I_MASK (0xFFFF0000U)
#define XCVR_RX_DIG_DFT_TONE_ANALYZER2_RX_TONE_ANA_OUT_I_SHIFT (16U)
/*! RX_TONE_ANA_OUT_I - Accumulator I path result */
#define XCVR_RX_DIG_DFT_TONE_ANALYZER2_RX_TONE_ANA_OUT_I(x) (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_DFT_TONE_ANALYZER2_RX_TONE_ANA_OUT_I_SHIFT)) & XCVR_RX_DIG_DFT_TONE_ANALYZER2_RX_TONE_ANA_OUT_I_MASK)
/*! @} */

/*! @name DFT_TONE_ANALYZER3 - DfT tone analyzer */
/*! @{ */

#define XCVR_RX_DIG_DFT_TONE_ANALYZER3_IPR_DFT_ANA_ACCUMULATION_LENGTH_MASK (0x7FFFU)
#define XCVR_RX_DIG_DFT_TONE_ANALYZER3_IPR_DFT_ANA_ACCUMULATION_LENGTH_SHIFT (0U)
#define XCVR_RX_DIG_DFT_TONE_ANALYZER3_IPR_DFT_ANA_ACCUMULATION_LENGTH(x) (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_DFT_TONE_ANALYZER3_IPR_DFT_ANA_ACCUMULATION_LENGTH_SHIFT)) & XCVR_RX_DIG_DFT_TONE_ANALYZER3_IPR_DFT_ANA_ACCUMULATION_LENGTH_MASK)

#define XCVR_RX_DIG_DFT_TONE_ANALYZER3_RX_TONE_ANA_OUT_ABS_MASK (0x7FFF8000U)
#define XCVR_RX_DIG_DFT_TONE_ANALYZER3_RX_TONE_ANA_OUT_ABS_SHIFT (15U)
#define XCVR_RX_DIG_DFT_TONE_ANALYZER3_RX_TONE_ANA_OUT_ABS(x) (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_DFT_TONE_ANALYZER3_RX_TONE_ANA_OUT_ABS_SHIFT)) & XCVR_RX_DIG_DFT_TONE_ANALYZER3_RX_TONE_ANA_OUT_ABS_MASK)
/*! @} */

/*! @name DCOC_DIG_CORR_RESULT - DCOC Digital Correction Result */
/*! @{ */

#define XCVR_RX_DIG_DCOC_DIG_CORR_RESULT_DCOC_DIG_CORR_Q_MASK (0xFFU)
#define XCVR_RX_DIG_DCOC_DIG_CORR_RESULT_DCOC_DIG_CORR_Q_SHIFT (0U)
/*! DCOC_DIG_CORR_Q - DCOC I-Channel Residual After Calibration */
#define XCVR_RX_DIG_DCOC_DIG_CORR_RESULT_DCOC_DIG_CORR_Q(x) (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_DCOC_DIG_CORR_RESULT_DCOC_DIG_CORR_Q_SHIFT)) & XCVR_RX_DIG_DCOC_DIG_CORR_RESULT_DCOC_DIG_CORR_Q_MASK)

#define XCVR_RX_DIG_DCOC_DIG_CORR_RESULT_DCOC_DIG_CORR_I_MASK (0xFF00U)
#define XCVR_RX_DIG_DCOC_DIG_CORR_RESULT_DCOC_DIG_CORR_I_SHIFT (8U)
/*! DCOC_DIG_CORR_I - DCOC Q-Channel Residual After Calibration */
#define XCVR_RX_DIG_DCOC_DIG_CORR_RESULT_DCOC_DIG_CORR_I(x) (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_DCOC_DIG_CORR_RESULT_DCOC_DIG_CORR_I_SHIFT)) & XCVR_RX_DIG_DCOC_DIG_CORR_RESULT_DCOC_DIG_CORR_I_MASK)
/*! @} */

/*! @name IQMC_CTRL1_DRS - IQ Mismatch Control 1 DRS */
/*! @{ */

#define XCVR_RX_DIG_IQMC_CTRL1_DRS_IQMC_GAIN_ADJ_MASK (0x7FFU)
#define XCVR_RX_DIG_IQMC_CTRL1_DRS_IQMC_GAIN_ADJ_SHIFT (0U)
/*! IQMC_GAIN_ADJ - IQ Mismatch Correction Gain Coeff DRS */
#define XCVR_RX_DIG_IQMC_CTRL1_DRS_IQMC_GAIN_ADJ(x) (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_IQMC_CTRL1_DRS_IQMC_GAIN_ADJ_SHIFT)) & XCVR_RX_DIG_IQMC_CTRL1_DRS_IQMC_GAIN_ADJ_MASK)

#define XCVR_RX_DIG_IQMC_CTRL1_DRS_IQMC_PHASE_ADJ_MASK (0xFFF0000U)
#define XCVR_RX_DIG_IQMC_CTRL1_DRS_IQMC_PHASE_ADJ_SHIFT (16U)
/*! IQMC_PHASE_ADJ - IQ Mismatch Phase Correction DRS */
#define XCVR_RX_DIG_IQMC_CTRL1_DRS_IQMC_PHASE_ADJ(x) (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_IQMC_CTRL1_DRS_IQMC_PHASE_ADJ_SHIFT)) & XCVR_RX_DIG_IQMC_CTRL1_DRS_IQMC_PHASE_ADJ_MASK)
/*! @} */

/*! @name TQI_CTRL - TQI control fields */
/*! @{ */

#define XCVR_RX_DIG_TQI_CTRL_IQ_AVG_DPTH_MASK    (0xFU)
#define XCVR_RX_DIG_TQI_CTRL_IQ_AVG_DPTH_SHIFT   (0U)
/*! IQ_AVG_DPTH - Number of IQ samples per IQ averaging window, in power of two.
 *  0b0000..IQ averager is bypassed
 *  0b0001..IQ averager uses 2 samples
 *  0b0010..IQ averager uses 4 samples
 *  0b0011..IQ averager uses 8 samples
 *  0b0100..IQ averager uses 16 samples
 */
#define XCVR_RX_DIG_TQI_CTRL_IQ_AVG_DPTH(x)      (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_TQI_CTRL_IQ_AVG_DPTH_SHIFT)) & XCVR_RX_DIG_TQI_CTRL_IQ_AVG_DPTH_MASK)

#define XCVR_RX_DIG_TQI_CTRL_MAG_AVG_DPTH_MASK   (0xF00U)
#define XCVR_RX_DIG_TQI_CTRL_MAG_AVG_DPTH_SHIFT  (8U)
/*! MAG_AVG_DPTH - Number of magnitude averaging windows, in power of two.
 *  0b0000..Magnitude averager is bypassed
 *  0b0001..Magnitude averager uses 2 windows
 *  0b0010..Magnitude averager uses 4 windows
 *  0b0011..Magnitude averager uses 8 windows
 *  0b0100..Magnitude averager uses 16 windows
 *  0b0101..Magnitude averager uses 32 windows
 */
#define XCVR_RX_DIG_TQI_CTRL_MAG_AVG_DPTH(x)     (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_TQI_CTRL_MAG_AVG_DPTH_SHIFT)) & XCVR_RX_DIG_TQI_CTRL_MAG_AVG_DPTH_MASK)

#define XCVR_RX_DIG_TQI_CTRL_TQI_EN_MASK         (0x10000U)
#define XCVR_RX_DIG_TQI_CTRL_TQI_EN_SHIFT        (16U)
/*! TQI_EN - Enables TQI operation.
 *  0b0..TQI operation is disabled.
 *  0b1..TQI operation is enabled.
 */
#define XCVR_RX_DIG_TQI_CTRL_TQI_EN(x)           (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_TQI_CTRL_TQI_EN_SHIFT)) & XCVR_RX_DIG_TQI_CTRL_TQI_EN_MASK)
/*! @} */

/*! @name TQI_THR - TQI thresholds */
/*! @{ */

#define XCVR_RX_DIG_TQI_THR_T1_MASK              (0x1FFU)
#define XCVR_RX_DIG_TQI_THR_T1_SHIFT             (0U)
/*! T1 - T1 threshold. */
#define XCVR_RX_DIG_TQI_THR_T1(x)                (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_TQI_THR_T1_SHIFT)) & XCVR_RX_DIG_TQI_THR_T1_MASK)

#define XCVR_RX_DIG_TQI_THR_T2_MASK              (0x1FF0000U)
#define XCVR_RX_DIG_TQI_THR_T2_SHIFT             (16U)
/*! T2 - T2 threshold */
#define XCVR_RX_DIG_TQI_THR_T2(x)                (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_TQI_THR_T2_SHIFT)) & XCVR_RX_DIG_TQI_THR_T2_MASK)

#define XCVR_RX_DIG_TQI_THR_INLINE_THR_TQI_MASK  (0xC0000000U)
#define XCVR_RX_DIG_TQI_THR_INLINE_THR_TQI_SHIFT (30U)
/*! INLINE_THR_TQI - INLINE_THR_TQI threshold */
#define XCVR_RX_DIG_TQI_THR_INLINE_THR_TQI(x)    (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_TQI_THR_INLINE_THR_TQI_SHIFT)) & XCVR_RX_DIG_TQI_THR_INLINE_THR_TQI_MASK)
/*! @} */

/*! @name CTRL2 - RXDIG Control 2 */
/*! @{ */

