zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_XCVR_RX_DIG.h
#define XCVR_RX_DIG_CTRL2_SN_AGC_INIT_IDX2_MASK  (0xFU)
#define XCVR_RX_DIG_CTRL2_SN_AGC_INIT_IDX2_SHIFT (0U)
/*! SN_AGC_INIT_IDX2 - AGC Initial Gain Index of the second part of CS sub-event in sniffer mode */
#define XCVR_RX_DIG_CTRL2_SN_AGC_INIT_IDX2(x)    (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_CTRL2_SN_AGC_INIT_IDX2_SHIFT)) & XCVR_RX_DIG_CTRL2_SN_AGC_INIT_IDX2_MASK)

#define XCVR_RX_DIG_CTRL2_RX_SAMPLE_ADJ_MASK     (0x700U)
#define XCVR_RX_DIG_CTRL2_RX_SAMPLE_ADJ_SHIFT    (8U)
/*! RX_SAMPLE_ADJ - RX sample delay line adjustment */
#define XCVR_RX_DIG_CTRL2_RX_SAMPLE_ADJ(x)       (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_CTRL2_RX_SAMPLE_ADJ_SHIFT)) & XCVR_RX_DIG_CTRL2_RX_SAMPLE_ADJ_MASK)

#define XCVR_RX_DIG_CTRL2_AM_ATT_EN_MASK         (0x10000U)
#define XCVR_RX_DIG_CTRL2_AM_ATT_EN_SHIFT        (16U)
/*! AM_ATT_EN - AM attack detection enable */
#define XCVR_RX_DIG_CTRL2_AM_ATT_EN(x)           (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_CTRL2_AM_ATT_EN_SHIFT)) & XCVR_RX_DIG_CTRL2_AM_ATT_EN_MASK)

#define XCVR_RX_DIG_CTRL2_AM_ATT_DELAY_MASK      (0x1E0000U)
#define XCVR_RX_DIG_CTRL2_AM_ATT_DELAY_SHIFT     (17U)
/*! AM_ATT_DELAY - AM attack delay */
#define XCVR_RX_DIG_CTRL2_AM_ATT_DELAY(x)        (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_CTRL2_AM_ATT_DELAY_SHIFT)) & XCVR_RX_DIG_CTRL2_AM_ATT_DELAY_MASK)

#define XCVR_RX_DIG_CTRL2_AM_ATT_OFFSET_MASK     (0x1E00000U)
#define XCVR_RX_DIG_CTRL2_AM_ATT_OFFSET_SHIFT    (21U)
/*! AM_ATT_OFFSET - RX sample delay line adjustment */
#define XCVR_RX_DIG_CTRL2_AM_ATT_OFFSET(x)       (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_CTRL2_AM_ATT_OFFSET_SHIFT)) & XCVR_RX_DIG_CTRL2_AM_ATT_OFFSET_MASK)

#define XCVR_RX_DIG_CTRL2_AM_ATT_SEL_MASK        (0x2000000U)
#define XCVR_RX_DIG_CTRL2_AM_ATT_SEL_SHIFT       (25U)
/*! AM_ATT_SEL - RX sample delay line adjustment */
#define XCVR_RX_DIG_CTRL2_AM_ATT_SEL(x)          (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_CTRL2_AM_ATT_SEL_SHIFT)) & XCVR_RX_DIG_CTRL2_AM_ATT_SEL_MASK)
/*! @} */

/*! @name NADM_CTRL - Controls for the NADM module */
/*! @{ */

#define XCVR_RX_DIG_NADM_CTRL_NADM_EN_MASK       (0x1U)
#define XCVR_RX_DIG_NADM_CTRL_NADM_EN_SHIFT      (0U)
/*! NADM_EN - NADM module enable.
 *  0b0..Nadm operation is disabled.
 *  0b1..Nadm operation is enabled.
 */
#define XCVR_RX_DIG_NADM_CTRL_NADM_EN(x)         (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_NADM_CTRL_NADM_EN_SHIFT)) & XCVR_RX_DIG_NADM_CTRL_NADM_EN_MASK)

#define XCVR_RX_DIG_NADM_CTRL_NADM_SRC_MASK      (0x2U)
#define XCVR_RX_DIG_NADM_CTRL_NADM_SRC_SHIFT     (1U)
/*! NADM_SRC - FM correlator path, select source.
 *  0b0..CHF in selected
 *  0b1..CHF out selected
 */
#define XCVR_RX_DIG_NADM_CTRL_NADM_SRC(x)        (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_NADM_CTRL_NADM_SRC_SHIFT)) & XCVR_RX_DIG_NADM_CTRL_NADM_SRC_MASK)

#define XCVR_RX_DIG_NADM_CTRL_NADM_DLY_MASK      (0x7CU)
#define XCVR_RX_DIG_NADM_CTRL_NADM_DLY_SHIFT     (2U)
/*! NADM_DLY - FM correlator path, NADM trigger delay after access address reception. */
#define XCVR_RX_DIG_NADM_CTRL_NADM_DLY(x)        (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_NADM_CTRL_NADM_DLY_SHIFT)) & XCVR_RX_DIG_NADM_CTRL_NADM_DLY_MASK)

#define XCVR_RX_DIG_NADM_CTRL_NADM_OFFSET_MASK   (0xF80U)
#define XCVR_RX_DIG_NADM_CTRL_NADM_OFFSET_SHIFT  (7U)
/*! NADM_OFFSET - FM correlator path, offset in the delay array. */
#define XCVR_RX_DIG_NADM_CTRL_NADM_OFFSET(x)     (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_NADM_CTRL_NADM_OFFSET_SHIFT)) & XCVR_RX_DIG_NADM_CTRL_NADM_OFFSET_MASK)

#define XCVR_RX_DIG_NADM_CTRL_NADM_DMD_LATENCY_MASK (0x1F000U)
#define XCVR_RX_DIG_NADM_CTRL_NADM_DMD_LATENCY_SHIFT (12U)
/*! NADM_DMD_LATENCY - FM symbol error path, NADM trigger delay after access address reception. */
#define XCVR_RX_DIG_NADM_CTRL_NADM_DMD_LATENCY(x) (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_NADM_CTRL_NADM_DMD_LATENCY_SHIFT)) & XCVR_RX_DIG_NADM_CTRL_NADM_DMD_LATENCY_MASK)

#define XCVR_RX_DIG_NADM_CTRL_NADM_FIR_LATENCY_MASK (0x3E0000U)
#define XCVR_RX_DIG_NADM_CTRL_NADM_FIR_LATENCY_SHIFT (17U)
/*! NADM_FIR_LATENCY - FM correlator path, delay between reference start and correlator start. */
#define XCVR_RX_DIG_NADM_CTRL_NADM_FIR_LATENCY(x) (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_NADM_CTRL_NADM_FIR_LATENCY_SHIFT)) & XCVR_RX_DIG_NADM_CTRL_NADM_FIR_LATENCY_MASK)

#define XCVR_RX_DIG_NADM_CTRL_NADM_SIZE_MASK     (0x1C00000U)
#define XCVR_RX_DIG_NADM_CTRL_NADM_SIZE_SHIFT    (22U)
/*! NADM_SIZE - NADM size aligned on RTT_TYPE standard value */
#define XCVR_RX_DIG_NADM_CTRL_NADM_SIZE(x)       (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_NADM_CTRL_NADM_SIZE_SHIFT)) & XCVR_RX_DIG_NADM_CTRL_NADM_SIZE_MASK)

#define XCVR_RX_DIG_NADM_CTRL_NADM_IDX_CAPTURE_MASK (0xE000000U)
#define XCVR_RX_DIG_NADM_CTRL_NADM_IDX_CAPTURE_SHIFT (25U)
/*! NADM_IDX_CAPTURE - Index used to get optimum fm_diff in DMA_DBG */
#define XCVR_RX_DIG_NADM_CTRL_NADM_IDX_CAPTURE(x) (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_NADM_CTRL_NADM_IDX_CAPTURE_SHIFT)) & XCVR_RX_DIG_NADM_CTRL_NADM_IDX_CAPTURE_MASK)
/*! @} */

/*! @name NADM_RES - NADM latest packet results. */
/*! @{ */

#define XCVR_RX_DIG_NADM_RES_NADM_MAX_CORR_MASK  (0x1FFU)
#define XCVR_RX_DIG_NADM_RES_NADM_MAX_CORR_SHIFT (0U)
/*! NADM_MAX_CORR - NADM maximum correlation value. */
#define XCVR_RX_DIG_NADM_RES_NADM_MAX_CORR(x)    (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_NADM_RES_NADM_MAX_CORR_SHIFT)) & XCVR_RX_DIG_NADM_RES_NADM_MAX_CORR_MASK)

#define XCVR_RX_DIG_NADM_RES_NADM_INST_MASK      (0x7000U)
#define XCVR_RX_DIG_NADM_RES_NADM_INST_SHIFT     (12U)
/*! NADM_INST - NADM correlator instance yielding maximum correlation value. */
#define XCVR_RX_DIG_NADM_RES_NADM_INST(x)        (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_NADM_RES_NADM_INST_SHIFT)) & XCVR_RX_DIG_NADM_RES_NADM_INST_MASK)
/*! @} */

/*! @name FCFO_CTRL - Fine CFO module controls. */
/*! @{ */

#define XCVR_RX_DIG_FCFO_CTRL_A_MUL_MASK         (0xFFU)
#define XCVR_RX_DIG_FCFO_CTRL_A_MUL_SHIFT        (0U)
/*! A_MUL - Alpha linear multiplication coeficient */
#define XCVR_RX_DIG_FCFO_CTRL_A_MUL(x)           (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_FCFO_CTRL_A_MUL_SHIFT)) & XCVR_RX_DIG_FCFO_CTRL_A_MUL_MASK)

#define XCVR_RX_DIG_FCFO_CTRL_A_DIV_MASK         (0xF000U)
#define XCVR_RX_DIG_FCFO_CTRL_A_DIV_SHIFT        (12U)
/*! A_DIV - Alpha linear division coeficient */
#define XCVR_RX_DIG_FCFO_CTRL_A_DIV(x)           (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_FCFO_CTRL_A_DIV_SHIFT)) & XCVR_RX_DIG_FCFO_CTRL_A_DIV_MASK)

#define XCVR_RX_DIG_FCFO_CTRL_FCFO_ENA_MASK      (0x10000U)
#define XCVR_RX_DIG_FCFO_CTRL_FCFO_ENA_SHIFT     (16U)
/*! FCFO_ENA - Enables FCFO module.
 *  0b0..Fcfo algorithm disabled.
 *  0b1..Fcfo algorithm enabled.
 */
#define XCVR_RX_DIG_FCFO_CTRL_FCFO_ENA(x)        (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_FCFO_CTRL_FCFO_ENA_SHIFT)) & XCVR_RX_DIG_FCFO_CTRL_FCFO_ENA_MASK)

