zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_XCVR_RX_DIG.h
#define XCVR_RX_DIG_FCFO_CTRL_OUT_IQ_MASK        (0x40000U)
#define XCVR_RX_DIG_FCFO_CTRL_OUT_IQ_SHIFT       (18U)
/*! OUT_IQ - FCFO output format.
 *  0b0..Fcfo output are g function values (previous/current).
 *  0b1..Fcfo output are IQ values.
 */
#define XCVR_RX_DIG_FCFO_CTRL_OUT_IQ(x)          (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_FCFO_CTRL_OUT_IQ_SHIFT)) & XCVR_RX_DIG_FCFO_CTRL_OUT_IQ_MASK)

#define XCVR_RX_DIG_FCFO_CTRL_TRIG_SRC_MASK      (0x300000U)
#define XCVR_RX_DIG_FCFO_CTRL_TRIG_SRC_SHIFT     (20U)
/*! TRIG_SRC - Selects FCFO trigger source.
 *  0b00..Selects TPM as trigger source
 *  0b01..Selects TFM as trigger source
 *  0b10..Selects software as trigger source.
 */
#define XCVR_RX_DIG_FCFO_CTRL_TRIG_SRC(x)        (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_FCFO_CTRL_TRIG_SRC_SHIFT)) & XCVR_RX_DIG_FCFO_CTRL_TRIG_SRC_MASK)

#define XCVR_RX_DIG_FCFO_CTRL_TRIG_DLY_MASK      (0x3000000U)
#define XCVR_RX_DIG_FCFO_CTRL_TRIG_DLY_SHIFT     (24U)
/*! TRIG_DLY - Delay between trigger and fcfo start.
 *  0b00..Selects 2us trigger delay.
 *  0b01..Selects 5us trigger delay.
 *  0b10..Selects 10us trigger delay.
 *  0b11..Selects 15us trigger delay.
 */
#define XCVR_RX_DIG_FCFO_CTRL_TRIG_DLY(x)        (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_FCFO_CTRL_TRIG_DLY_SHIFT)) & XCVR_RX_DIG_FCFO_CTRL_TRIG_DLY_MASK)

#define XCVR_RX_DIG_FCFO_CTRL_A_OVF_MASK         (0x10000000U)
#define XCVR_RX_DIG_FCFO_CTRL_A_OVF_SHIFT        (28U)
/*! A_OVF - Alpha multiplier overflow. */
#define XCVR_RX_DIG_FCFO_CTRL_A_OVF(x)           (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_FCFO_CTRL_A_OVF_SHIFT)) & XCVR_RX_DIG_FCFO_CTRL_A_OVF_MASK)

#define XCVR_RX_DIG_FCFO_CTRL_FCFO_ERR_MASK      (0x20000000U)
#define XCVR_RX_DIG_FCFO_CTRL_FCFO_ERR_SHIFT     (29U)
/*! FCFO_ERR - FCFO value error. */
#define XCVR_RX_DIG_FCFO_CTRL_FCFO_ERR(x)        (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_FCFO_CTRL_FCFO_ERR_SHIFT)) & XCVR_RX_DIG_FCFO_CTRL_FCFO_ERR_MASK)

#define XCVR_RX_DIG_FCFO_CTRL_FCFO_DONE_MASK     (0x40000000U)
#define XCVR_RX_DIG_FCFO_CTRL_FCFO_DONE_SHIFT    (30U)
/*! FCFO_DONE - FCFO done. */
#define XCVR_RX_DIG_FCFO_CTRL_FCFO_DONE(x)       (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_FCFO_CTRL_FCFO_DONE_SHIFT)) & XCVR_RX_DIG_FCFO_CTRL_FCFO_DONE_MASK)
/*! @} */

/*! @name FCFO_TN - Tone parameters. */
/*! @{ */

#define XCVR_RX_DIG_FCFO_TN_TN_F1_INC_MASK       (0x7FU)
#define XCVR_RX_DIG_FCFO_TN_TN_F1_INC_SHIFT      (0U)
/*! TN_F1_INC - Tone F1 increment. */
#define XCVR_RX_DIG_FCFO_TN_TN_F1_INC(x)         (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_FCFO_TN_TN_F1_INC_SHIFT)) & XCVR_RX_DIG_FCFO_TN_TN_F1_INC_MASK)

#define XCVR_RX_DIG_FCFO_TN_TN_F1_DIV_MASK       (0x700U)
#define XCVR_RX_DIG_FCFO_TN_TN_F1_DIV_SHIFT      (8U)
/*! TN_F1_DIV - Tone F1 clock divisor. */
#define XCVR_RX_DIG_FCFO_TN_TN_F1_DIV(x)         (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_FCFO_TN_TN_F1_DIV_SHIFT)) & XCVR_RX_DIG_FCFO_TN_TN_F1_DIV_MASK)

#define XCVR_RX_DIG_FCFO_TN_TN_F2_INC_MASK       (0x7F0000U)
#define XCVR_RX_DIG_FCFO_TN_TN_F2_INC_SHIFT      (16U)
/*! TN_F2_INC - Tone F2 increment. */
#define XCVR_RX_DIG_FCFO_TN_TN_F2_INC(x)         (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_FCFO_TN_TN_F2_INC_SHIFT)) & XCVR_RX_DIG_FCFO_TN_TN_F2_INC_MASK)

#define XCVR_RX_DIG_FCFO_TN_TN_F2_DIV_MASK       (0x7000000U)
#define XCVR_RX_DIG_FCFO_TN_TN_F2_DIV_SHIFT      (24U)
/*! TN_F2_DIV - Tone F2 clock divisor. */
#define XCVR_RX_DIG_FCFO_TN_TN_F2_DIV(x)         (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_FCFO_TN_TN_F2_DIV_SHIFT)) & XCVR_RX_DIG_FCFO_TN_TN_F2_DIV_MASK)
/*! @} */

/*! @name FCFO_TN_PH - F2 carrier iq phases */
/*! @{ */

#define XCVR_RX_DIG_FCFO_TN_PH_F2_PH_I_MASK      (0x1FFU)
#define XCVR_RX_DIG_FCFO_TN_PH_F2_PH_I_SHIFT     (0U)
/*! F2_PH_I - F2 carrier I start phase */
#define XCVR_RX_DIG_FCFO_TN_PH_F2_PH_I(x)        (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_FCFO_TN_PH_F2_PH_I_SHIFT)) & XCVR_RX_DIG_FCFO_TN_PH_F2_PH_I_MASK)

#define XCVR_RX_DIG_FCFO_TN_PH_F2_PH_Q_MASK      (0x1FF0000U)
#define XCVR_RX_DIG_FCFO_TN_PH_F2_PH_Q_SHIFT     (16U)
/*! F2_PH_Q - F2 carrier Q start phase */
#define XCVR_RX_DIG_FCFO_TN_PH_F2_PH_Q(x)        (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_FCFO_TN_PH_F2_PH_Q_SHIFT)) & XCVR_RX_DIG_FCFO_TN_PH_F2_PH_Q_MASK)
/*! @} */

/*! @name FCFO_RES - Fine CFO results. */
/*! @{ */

#define XCVR_RX_DIG_FCFO_RES_G_CUR_MASK          (0xFFFFU)
#define XCVR_RX_DIG_FCFO_RES_G_CUR_SHIFT         (0U)
/*! G_CUR - g function, current value. */
#define XCVR_RX_DIG_FCFO_RES_G_CUR(x)            (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_FCFO_RES_G_CUR_SHIFT)) & XCVR_RX_DIG_FCFO_RES_G_CUR_MASK)

#define XCVR_RX_DIG_FCFO_RES_G_PRV_MASK          (0xFFFF0000U)
#define XCVR_RX_DIG_FCFO_RES_G_PRV_SHIFT         (16U)
/*! G_PRV - g function, previous value. */
#define XCVR_RX_DIG_FCFO_RES_G_PRV(x)            (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_FCFO_RES_G_PRV_SHIFT)) & XCVR_RX_DIG_FCFO_RES_G_PRV_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group XCVR_RX_DIG_Register_Masks */


/*!
 * @}
 */ /* end of group XCVR_RX_DIG_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_XCVR_RX_DIG_H_ */

